app/controllers/linkedin_controller.rb

  def generate_linkedin_oauth_url
    if LinkedinOauthSetting.find_by_user_id(current_user.id).nil?
---
SELECT  "linkedin_oauth_settings".* FROM "linkedin_oauth_settings" WHERE "linkedin_oauth_settings"."user_id" = $1 LIMIT 1  [["user_id", 1]]

  def oauth_account
    client = LinkedIn::Client.new('75yx55olrsaoez', 'FJ4zzDTko2ah61DW', @@config)
    pin = params[:oauth_verifier]
    if pin
      atoken, asecret = client.authorize_from_request(session[:rtoken], session[:rsecret], pin)
      LinkedinOauthSetting.create!(:asecret => asecret, :atoken => atoken, :user_id => current_user.id)
---
INSERT INTO "linkedin_oauth_settings" ("asecret", "atoken", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def index
    unless LinkedinOauthSetting.find_by_user_id(current_user.id).nil?
---
SELECT  "linkedin_oauth_settings".* FROM "linkedin_oauth_settings" WHERE "linkedin_oauth_settings"."user_id" = $1 LIMIT 1  [["user_id", 1]]